In [177]:
# Importing pandas
import pandas as pd

In [178]:
print(pd)

<module 'pandas' from 'c:\\Users\\NDUKWE\\AppData\\Local\\Programs\\Python\\Python311\\Lib\\site-packages\\pandas\\__init__.py'>

Series -> One dimensional arrays that can store various data types.

In [179]:
# converting tuple to series
h = ('AA', '2012-02-01', 100, 10.2)
s = pd.Series(h)

type(s)

pandas.core.series.Series

In [180]:
s

0            AA
1    2012-02-01
2           100
3          10.2
dtype: object

In [181]:
# converting dict to Series
d = {'name': 'IBM', 'date':'2010-09-08','shares':100, 'price':10.2}
ds = pd.Series(d)
print(d)
print(ds)

{'name': 'IBM', 'date': '2010-09-08', 'shares': 100, 'price': 10.2}
name             IBM
date      2010-09-08
shares           100
price           10.2
dtype: object

In [182]:
type(ds)

pandas.core.series.Series

In [183]:
m =  ['Jim', '2001-08-02', 90, 3.2]
m = pd.Series(m, index=['name', 'date', 'amount', 'percentage'])
m

name                 Jim
date          2001-08-02
amount                90
percentage           3.2
dtype: object

In [184]:
m['percentage']

3.2

In [185]:
m[['name', 'percentage']]

name          Jim
percentage    3.2
dtype: object

DataFrame -> Two Dimensional arrays (row and colum index)

In [186]:
data = {
    'name': [ 'Jim', 'Ray', 'Paul'  ],
    'shares': [ '10', '13', '12'],
    'price': [ '200', '131', '144'],
    'color':  [ 'blue', 'red', 'pink'],
}

In [187]:
data

{'name': ['Jim', 'Ray', 'Paul'],
 'shares': ['10', '13', '12'],
 'price': ['200', '131', '144'],
 'color': ['blue', 'red', 'pink']}

In [188]:
df = pd.DataFrame(data=data)
type(df)

pandas.core.frame.DataFrame

In [189]:
df

   name shares price color
0   Jim     10   200  blue
1   Ray     13   131   red
2  Paul     12   144  pink

In [190]:
df['size'] = ['big', 'small', 'large']
df

   name shares price color   size
0   Jim     10   200  blue    big
1   Ray     13   131   red  small
2  Paul     12   144  pink  large

In [191]:
df['age'] = 'null'
df

   name shares price color   size   age
0   Jim     10   200  blue    big  null
1   Ray     13   131   red  small  null
2  Paul     12   144  pink  large  null

In [192]:
df.index = ['one','two', 'three']
df

       name shares price color   size   age
one     Jim     10   200  blue    big  null
two     Ray     13   131   red  small  null
three  Paul     12   144  pink  large  null

In [193]:
df.set_index(['name']) #inplace = True -> makes it permanent
df

       name shares price color   size   age
one     Jim     10   200  blue    big  null
two     Ray     13   131   red  small  null
three  Paul     12   144  pink  large  null

In [194]:
df['shares']

one      10
two      13
three    12
Name: shares, dtype: object

In [195]:
df.loc['one'] # select a single row

name       Jim
shares      10
price      200
color     blue
size       big
age       null
Name: one, dtype: object

In [196]:
df.loc[:, 'shares']

one      10
two      13
three    12
Name: shares, dtype: object

In [197]:
df.loc['one',:]

name       Jim
shares      10
price      200
color     blue
size       big
age       null
Name: one, dtype: object

In [198]:
del df['age']

In [199]:
df

       name shares price color   size
one     Jim     10   200  blue    big
two     Ray     13   131   red  small
three  Paul     12   144  pink  large

In [200]:
df.drop('shares', axis = 1)

       name price color   size
one     Jim   200  blue    big
two     Ray   131   red  small
three  Paul   144  pink  large

In [201]:
df.drop('two', axis=0)

       name shares price color   size
one     Jim     10   200  blue    big
three  Paul     12   144  pink  large

In [202]:
import pandas as pd

# Reading files 
casts = pd.read_csv('cast.csv', index_col=None)
casts.head() # Getting the first five elements of the DataFrame

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [203]:
titles = pd.read_csv('titles.csv', index_col=None) # if err -> encoding= 'utf-8'
titles.tail() #getting the last five elements of the DataFrame

                      title  year
49995                 Rebel  1970
49996               Suzanne  1996
49997                 Bomba  2013
49998  Aao Jao Ghar Tumhara  1984
49999            Mrs. Munck  1995

In [204]:
len(titles)

50000

Data Operations

In [205]:
# row and column selection 

t = titles['title']
type(t)

pandas.core.series.Series

In [206]:
t.head()

0             The Rising Son
1    The Thousand Plane Raid
2           Crucea de piatra
3                    Country
4                 Gaiking II
Name: title, dtype: object

In [207]:
# filtering data

after85 = titles[titles['year'] > 1985] # movies after 1985
after85.head()

              title  year
0    The Rising Son  1990
2  Crucea de piatra  1993
3           Country  2000
4        Gaiking II  2011
5       Medusa (IV)  2015

In [208]:
t = titles
movies90 = t[(t['year'] >= 1990) & (t['year'] < 2000)] # display movies in the year 1990 - 1999
movies90

                             title  year
0                   The Rising Son  1990
2                 Crucea de piatra  1993
12        Poka Makorer Ghar Bosoti  1996
19                Maa Durga Shakti  1999
24            Conflict of Interest  1993
...                            ...   ...
49969           Chi mei wang liang  1998
49979  Gagay: Prinsesa ng brownout  1993
49987                I Won't Dance  1992
49996                      Suzanne  1996
49999                   Mrs. Munck  1995

[4803 rows x 2 columns]

In [209]:
# sorting

macbeth = t[t['title'] == 'Macbeth'] # find all movies named as Macbeth
macbeth.head()

         title  year
4226   Macbeth  1913
9322   Macbeth  2006
11722  Macbeth  2013
17166  Macbeth  1997
25847  Macbeth  1998

In [210]:
macbeth.sort_index() # default is sorted by index

         title  year
4226   Macbeth  1913
9322   Macbeth  2006
11722  Macbeth  2013
17166  Macbeth  1997
25847  Macbeth  1998

In [211]:
macbeth.sort_values('year') # sorting by year

         title  year
4226   Macbeth  1913
17166  Macbeth  1997
25847  Macbeth  1998
9322   Macbeth  2006
11722  Macbeth  2013

In [212]:
casts

,title,year,name,type,character,n
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,31.0
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN
...,...,...,...,...,...,...
74996,Mia fora kai ena... moro,2011,Penelope Anastasopoulou,actress,Popi voulkanizater,11.0
74997,The Magician King,2004,Tiannah Anastassiades,actress,Unicycle Race Attendant,NaN
74998,Festival of Lights,2010,Zoe Anastassiou,actress,Guidance Counselor,20.0
74999,Toxic Tutu,2016,Zoe Anastassiou,actress,Demon of Toxicity,NaN
75000,Fugitive Pieces,2007,Anastassia Anastassopoulou,actress,Laundry Girl,25.0

In [213]:
# Null Values
casts.loc[3:4]

                  title  year     name   type                character   n
3  Secret in Their Eyes  2015  $hutter  actor          2002 Dodger Fan NaN
4            Steve Jobs  2015  $hutter  actor  1988 Opera House Patron NaN

In [214]:
c = casts
c['n'].isnull().head()

0    False
1    False
2    False
3     True
4     True
Name: n, dtype: bool

In [215]:
c[c['n'].isnull()].head()

,title,year,name,type,character,n
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN
5,Straight Outta Compton,2015,$hutter,actor,Club Patron,NaN
6,Straight Outta Compton,2015,$hutter,actor,Dopeman,NaN
7,For Thy Love 2,2009,Bee Moe $lim,actor,Thug 1,NaN

In [216]:
c_fill = c[c['n'].isnull()].fillna('NA') # can also use ffill and bfill
c_fill

,title,year,name,type,character,n
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NA
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NA
5,Straight Outta Compton,2015,$hutter,actor,Club Patron,NA
6,Straight Outta Compton,2015,$hutter,actor,Dopeman,NA
7,For Thy Love 2,2009,Bee Moe $lim,actor,Thug 1,NA
...,...,...,...,...,...,...
74984,Ovum,2015,Christina Rosas Anastasiou,actress,Fertility Clinic Receptionist,NA
74985,7 avlu,2009,Evmorfia Anastasiou,actress,Eleni,NA
74993,I teliki apopliromi,2013,Mara Anastasopoulou,actress,Marina's friend,NA
74997,The Magician King,2004,Tiannah Anastassiades,actress,Unicycle Race Attendant,NA
74999,Toxic Tutu,2016,Zoe Anastassiou,actress,Demon of Toxicity,NA

In [219]:
# String Operations 

t = titles
t[t['title'] == 'Maa'] # searching for the movie Maa

      title  year
38880   Maa  1968

In [221]:
t[t['title'].str.startswith('Maa')].head()

                  title  year
19     Maa Durga Shakti  1999
334          Maarek hob  2004
3046      Maa Aur Mamta  1970
6304   Maampazhakkaalam  2004
7470  Maa Vaibhav Laxmi  1989

In [222]:
# Count values 

t['year'].value_counts().head() # number of years for each year in the DataFrame

2016    2363
2017    2138
2015    1849
2014    1701
2013    1609
Name: year, dtype: int64

In [224]:
c['type'].value_counts().head() # number of actors or actresses in the Dataframe

actor      50000
actress    25001
Name: type, dtype: int64

In [ ]:
# GroupBy